using Tyuiu.KarnaukhovDA.Sprint1.Task3.V13.Lib;
internal class Program
{
    private static void Main(string[] args)
    {
        DataService ds = new DataService();

        Console.Title = "Спринт #1 | Выполнил: Карнаухов Д. А. | СМАРТб-25-1";
        Console.WriteLine("*********************************************************************************************************");
        Console.WriteLine("* Спринт #1                                                                                             *");
        Console.WriteLine("* Тема: Операторы составного присваивания                                                               *");
        Console.WriteLine("* Задание #3                                                                                            *");
        Console.WriteLine("* Вариант #13                                                                                           *");
        Console.WriteLine("* Выполнил: Карнаухов Даниил Александрович | СМАРТб-25-1                                                *");
        Console.WriteLine("*********************************************************************************************************");
        Console.WriteLine("* УСЛОВИЕ:                                                                                              *");
        Console.WriteLine("* Написать программу, которая запрашивает у пользователя исходные данные,                               *");
        Console.WriteLine("* выполняет указанные расчёты и печатает результат на экране.                                           *");
        Console.WriteLine("*                                                                                                       *");
        Console.WriteLine("*********************************************************************************************************");
        Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                                                      *");
        Console.WriteLine("*********************************************************************************************************");

        double number = 123;
        Console.WriteLine("Найти =" + (number));

        Console.WriteLine("*********************************************************************************************************");
        Console.WriteLine("* РЕЗУЛЬТАТ:                                                                                            *");
        Console.WriteLine("*********************************************************************************************************");

        Console.WriteLine("Произведение цифр заданного трехзначного числа =" + ds.MultiplyOfDigits(number));

        Console.ReadKey();
    }
}